backend/app/controllers/games_controller.rb

INSERT INTO "games" ("score", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", 1], ["user_id", 2], ["created_at", "2018-10-04 19:31:26.674540"], ["updated_at", "2018-10-04 19:31:26.674540"]]
---
  def create
    @game = Game.create(score:params[:score],user_id:params[:user][:id])