backend/app/controllers/users_controller.rb

  def create
    @user = User.create({name:params[:name]})
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "whatever"], ["created_at", "2018-10-03 20:28:45.577290"], ["updated_at", "2018-10-03 20:28:45.577290"]]